# Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N]. 
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. В последующих строках записаны N целых чисел Ai. 
# Последняя строка содержит число X
# n = 5
# 1 2 3 4 5
# x = 3
# -> 1
# 1 способ
# n = int(input('Введите значение N: '))
# a = map(int, input('Введите через пробел несколько чисел: ').split())
# x = int(input('Введите число X: '))
# print(sum(map(lambda z: int(z == x), a)))

# 2 способ
list_1 = []
n = int(input('введите число N  '))
x= int(input('введите число Х  '))
count=0
for i in range(1,n+1):
    list_1.append(i)
print(list_1)

for i in range(1, len(list_1)):
    if list_1[i]==x:
        count=count+1
print(count)

